/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; data = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NOLLA>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "AA-kompromissi";

/* Label of field in authority info access extension */
"Access Location" = "Käyttöpaikka";

/* Label of field in authority info access extension */
"Access Method" = "Käyttötapa";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Yhteysmääritykset muuttuneet";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "Algoritmi";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Myöntäjän varmenteen sarjanumero";

/* Authority info access extension label */
"Authority Information Access" = "Myöntäjän tietojen käyttö";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Varmentajan avaintunniste (AKID)";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Perusrajoitukset";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Bittijono";

/* No comment provided by engineer. */
"bits" = "bittiä";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Tavujono";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "tavua";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "CA-kompromissi";

/* X.509 key usage bitfield name */
"Cert Sign" = "Varmenteen tunnus";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Varmentaja";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Varmenteen pysäytys";

/* Certificate Policies extension label */
"Certificate Policies" = "Varmennekäytännöt";

/* No comment provided by engineer. */
"Certificate Type" = "Varmennetyyppi";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Toiminnon keskeytyminen";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Kriittinen";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "CRL-jakopisteet";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "CRL-myöntäjä";

/* X.509 key usage bitfield name */
"CRL Sign" = "CRL-merkki";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Data";

/* X.509 key usage bitfield name */
"Data Encipherment" = "Datan salaus";

/* X.509 key usage bitfield name */
"Decipher Only" = "Pura vain salaus";

/* X.509 key usage bitfield name */
"Digital Signature" = "Digitaalinen allekirjoitus";

/* label for general name field value */
"Directory Name" = "Hakemiston nimi";

/* label for general name field value */
"DNS Name" = "DNS-nimi";

/* label for general name field value */
"EDI Party Name" = "EDI-osapuolen nimi";

/* label for general name field value */
"Email Address" = "Sähköpostiosoite";

/* X.509 key usage bitfield name */
"Encipher Only" = "Salaa vain";

/* No comment provided by engineer. */
"Expired" = "Vanhentunut";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Vanhenee";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Eksplisiittinen teksti";

/* Extended key usage extension label */
"Extended Key Usage" = "Laajennettu avaimen käyttö";

/* Label used for General Name entry when value is invalid */
"General Name" = "Yleisnimi";

/* Label used for General Names when value is invalid */
"General Names" = "Yleisnimet";

/* No comment provided by engineer. */
"Hostname mismatch." = "Palvelinnimi ei sama.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Estä käytännön kuvaus";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Virheellinen %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Virheellinen varmenneketjulinkitys.";

/* label for general name field value */
"IP Address" = "IP-osoite";

/* No comment provided by engineer. */
"Issued By" = "Myöntäjä";

/* No comment provided by engineer. */
"Issuer Name" = "Myöntäjän nimi";

/* No comment provided by engineer. */
"Issuer Summary" = "Myöntäjäyhteenveto";

/* No comment provided by engineer. */
"Issuer Unique ID" = "Myöntäjän tunniste";

/* X.509 key usage bitfield name */
"Key Agreement" = "Avainsopimus";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Avaimen kompromissi";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Avaimen salaus";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Avaimen tunniste";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Nimi suhteessa CRL-myöntäjään";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "Ei";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "Ei purettavissa";

/* field value of parameters field when no parameters are present */
"none" = "ei mitään";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "ei näytetä (merkki = %1$@; pituus %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Voimassa päättyen";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Voimassa alkaen";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Huomautusnumerot";

/* Netscape certificate type usage value */
"Object Signing" = "Objektin allekirjoitus";

/* Netscape certificate type usage value */
"Object Signing CA" = "Objektin allekirjoituksen varmentaja";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Oid liian pitkä";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "Yksi tai useampi varmenne on vanhentunut tai ei vielä voimassa.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "Löytyi yksi tai useampi ei-tuettu kriittinen laajennus.";

/* Label of field in Certificate Policies extension */
"Organization" = "Organisaatio";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Muu nimi";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "Parametrit";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Polun pituuden rajoitus";

/* Policy constraints extension label */
"Policy Constraints" = "Käytäntörajoitukset";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Käytäntötunnus #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Käytäntömäärite #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Käytäntövaatimukset eivät täyty.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "Yksityisen avaimen käyttöaika";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "Oikeus peruutettu";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Julkisen avaimen algoritmi";

/* No comment provided by engineer. */
"Public Key Data" = "Julkisen avaimen data";

/* Label of field in extended key usage extension */
"Purpose" = "Tarkoitus";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Määrite";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "Syyt";

/* label for general name field value */
"Registered ID" = "Rekisteröity tunnus";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Vaadi tarkkaa käytäntöä";

/* Netscape certificate type usage value */
"Reserved" = "Varattu";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Ei-luotettu juurivarmenne.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME-varmentaja";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Sekvenssi";

/* No comment provided by engineer. */
"Serial Number" = "Sarjanumero";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "Aseta";

/* No comment provided by engineer. */
"Signature" = "Allekirjoitus";

/* No comment provided by engineer. */
"Signature Algorithm" = "Allekirjoitusalgoritmi";

/* Netscape certificate type usage value */
"SSL CA" = "SSL-varmenteen myöntäjä";

/* Netscape certificate type usage value */
"SSL client" = "SSL-asiakas";

/* Netscape certificate type usage value */
"SSL server" = "SSL-palvelin";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Kohteen avaintunniste (SKID)";

/* No comment provided by engineer. */
"Subject Name" = "Kohteen nimi";

/* No comment provided by engineer. */
"Subject Unique ID" = "Kohteen yksilöllinen tunniste";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Korvattu";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "Varmenteen myöntäjä on vanhentunut";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "Varmenteen myöntäjä ei ole vielä voimassa";

/* No comment provided by engineer. */
"This certificate has expired" = "Varmenne on vanhentunut";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "Varmenne ei ole vielä voimassa";

/* The certificate is temporally valid */
"This certificate is valid" = "Varmenne kelpaa";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "%@ ei jäsennetty";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Käyttämätön";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "Käyttö";

/* No comment provided by engineer. */
"Valid from" = "Voimassa alkaen";

/* No comment provided by engineer. */
"Version" = "Versio";

/* label for general name field value */
"X.400 Address" = "X.400-osoite";

/* Label of a X.501 Name */
"X.501 Name" = "X.501-nimi";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "X.509-versio %1$d %2$svarmenne";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Kyllä";

